[
  {
    "name": "Accueil des participants",
    "startDate": "2018-11-22T08:00:00+02:00",
    "endDate": "2018-11-22T08:45:00+02:00"
  },
  {
    "name": "Plénière d'accueil",
    "startDate": "2018-11-22T08:45:00+02:00",
    "endDate": "2018-11-22T09:00:00+02:00",
    "location": "Salle A",
    "speakers": [
      {
        "name": "L'équipe de Codeurs en Seine"
      }
    ]
  },
  {
    "name": "Management d’une équipe sportive",
    "startDate": "2018-11-22T09:00:00+02:00",
    "endDate": "2018-11-22T09:40:00+02:00",
    "description": "5 thèmes pour la création d'une équipe de choc : La formation, le recrutement, la définition des objectifs, la stratégie pour y accéder et le travail d’équipe.",
    "location": "Salle A",
    "category": "Keynote",
    "speakers": [
      {
        "name": "Guy Fournier"
      }
    ]
  },
  {
    "name": "Pause",
    "startDate": "2018-11-22T09:40:00.000Z",
    "endDate": "2018-11-22T10:00:00.000Z",
    "description": "Boire un coup, papoter, visiter les stands ;)"
  },
  {
    "name": "Symfony 4 - le framework PHP bâti pour grandir avec vos projets",
    "startDate": "2018-11-22T10:00:00.000Z",
    "endDate": "2018-11-22T11:00:00.000Z",
    "description": "Symfony est un des projets open-source les plus actifs sur GitHub. À n'en pas douter, cet intérêt constamment renouvelé pour la technologie est la clef qui lui permet d'être à la fois à la pointe de l'état de l'art, et d'une stabilité éprouvée sur le long terme. Lors de cette conférence, venez découvrir comment la communauté a réussi à produire un framework PHP à la fois performant, facile à prendre en main, permettant les architectures logicielles les plus évoluées et conçu pour le cloud.",
    "location": "Salle A",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Nicolas Grekas"
      }
    ]
  },
  {
    "name": "Agilité : 28 jours plus tard",
    "startDate": "2018-11-22T10:00:00.000Z",
    "endDate": "2018-11-22T11:00:00.000Z",
    "description": "Ca y est, l’agilité est enfin mise en place dans votre entreprise et tout fonctionne… 28 jours plus tard, ce qui existait et semblait acquis pour les 10 prochaines années vole en éclat…",
    "location": "Salle B",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Nicolas Saillard"
      }
    ]
  },
  {
    "name": ".Net Standard 2.0 & Feedbacks",
    "startDate": "2018-11-22T10:00:00.000Z",
    "endDate": "2018-11-22T11:00:00.000Z",
    "description": "Au début il y'avait .Net Framework, puis vinrent entre autre Silverlight (paix à son âme) .Net Core, UWP, Xamarin and so on... **.Net Standard 2.0** permet de standardiser les API et nous sort de l'enfer des **PCL**. Nous verrons dans un premier temps ce qu'est .Net Standard et pourquoi vous devez aujourd'hui vous y intéresser de trés trés prés ! Ensuite, au travers d'un projet OSS, **Dotmim.Sync** nous parlerons de synchronisation de base de données. Ou comment, en 4 lignes de codes, vous pouvez synchroniser une base de données serveur (comme **SQL Server** ou **MySQL**) avec une base de données cliente (comme **SQLite**) embarquée dans une application mobile, avec une gestion fine des changements ou des conflits. Et comme nous sommes sous **.Net Standard**, vous pourrez utiliser ce framework un peu partout ;)",
    "location": "Salle C",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Sébastien Pertus"
      }
    ]
  },
  {
    "name": "Des microservices aux migroservices",
    "startDate": "2018-11-22T10:00:00.000Z",
    "endDate": "2018-11-22T11:00:00.000Z",
    "description": "Ca y est, vous avez enfin la possibilité de démarrer un nouveau projet ou de migrer un de vos anciens monolithes et vous décidez de partir en architecture microservices !",
    "location": "Salle D",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Francois Teychene"
      }
    ]
  },
  {
    "name": "Vanilla JS 2018",
    "startDate": "2018-11-22T11:00:00.000Z",
    "endDate": "2018-11-22T12:00:00.000Z",
    "description": "Imaginez une application Web qui utiliserait toutes les nouvelles APIs des navigateurs en même temps. Ce n'est peut être pas le projet le plus raisonnable pour un besoin client mais pour de la veille, c'est passionnant ! Je vous propose un retour sur cette expérience un peu hors du commun.",
    "location": "Salle A",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Matthieu Lux"
      }
    ]
  },
  {
    "name": "Le marketing de la honte et le code du monde réel",
    "startDate": "2018-11-22T11:00:00.000Z",
    "endDate": "2018-11-22T12:00:00.000Z",
    "description": "Dans cette conférence, j'évoque le problème entre le marketing du dévelopeur, le monde réel, et le fait qu'on demande à tant de dev d'avoir honte de leur travail. Là dessus, j'explique pourquoi la notion de dette technique a été pervertie, et je reboucle sur les moyen de faire évoluer son équipe.",
    "location": "Salle B",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Quentin Adam"
      }
    ]
  },
  {
    "name": "D'une architecture web MVC à une architecture Clean Hexagonale",
    "startDate": "2018-11-22T11:00:00.000Z",
    "endDate": "2018-11-22T12:00:00.000Z",
    "description": "Aujourd'hui, de nombreuses applications ont été développées en utilisant le pattern MVC. La promesse de l'**architecture hexagonale** et de la **clean architecture** est de simplifier la maintenabilité de nos applications et l'évolutivité qui nous fait souvent défaut. En partant d'une base de code MVC, nous ferons évoluer ce code pour passer à une architecture hexagonale en isolant le cœur métier de tout le reste (outils, briques d'infrastructures). Nous verrons comment séparer les accès à une base de données/un système de fichier/un serveur de mail de notre code métier. Et nous comprendrons ce que ça peut nous apporter dans notre quotidien de développeur.",
    "location": "Salle C",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Céline Gilet"
      }
    ]
  },
  {
    "name": "UI/UX pour les développeurs",
    "startDate": "2018-11-22T11:00:00.000Z",
    "endDate": "2018-11-22T12:00:00.000Z",
    "description": "En tant que développeur, je fais des interfaces qui font le job, mais qui sont toutes moches. Je vous propose de passer en revue des conseils UI/UX pour embellir vos applications au travers notamment des pages incontournables de nos applications, les formulaires et les tableaux de données. Réussir à afficher une page en quelques secondes est chose aisée comparé à la rendre compréhensible en quelques secondes. Comment donner envie à nos utilisateurs de remplir les formulaires, quelles sont les erreurs à ne pas faire. Comment présenter des données, il y a le bon tableau et le mauvais tableau.",
    "location": "Salle D",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Etienne Crombez"
      }
    ]
  },
  {
    "name": "Personnalisation et Systèmes de Recommandation chez vente-privee",
    "startDate": "2018-11-22T12:00:00.000Z",
    "endDate": "2018-11-22T12:15:00.000Z",
    "description": "Les recommandations et la personnalisation ont un gros impact sur l’expérience d’un utilisateur, et c’est d’autant plus vrai pour les sites d’e-commerce. Chez vente-privee nous utilisons ces technologies dans différents cas de figure. Cette présentation est l'occasion de découvrir le fonctionnement de la personnalisation du catalogue de produits telle que nous l’avons mise en place à vente-privee.",
    "location": "Salle A",
    "category": "Quicky",
    "speakers": [
      {
        "name": "Betty Moreschini"
      }
    ]
  },
  {
    "name": "Style(d) et React, même Compo",
    "startDate": "2018-11-22T12:00:00.000Z",
    "endDate": "2018-11-22T12:15:00.000Z",
    "description": "Avec React, vous pouviez faire du HTML en JS. Et pourquoi ne pas aller plus loin ? Avec Styled-components, ajoutons la puissance du CSS-in-JS à notre application. #Une combinaison détonante à découvrir avec nous",
    "location": "Salle B",
    "category": "Quicky",
    "speakers": [
      {
        "name": "Marion Deveaux"
      },
      {
        "name": "Valentin Desportes"
      }
    ]
  },
  {
    "name": "Détectez et trackez les vulnérabilités qui se cachent dans vos dépendances",
    "startDate": "2018-11-22T12:00:00.000Z",
    "endDate": "2018-11-22T12:15:00.000Z",
    "description": "44% des applications contiennent des vulnérabilités critiques dans les librairies open-source qu'elles utilisent et cela bien que des bonnes pratiques comme OWASP Top 10 se soient généralisées. Ne laissez plus ces petites bêtes incuber bien au chaud au sein de votre appli ! Grâce à ce talk, vous apprendrez comment sont répertoriées ces vilaines bestioles (NVD, CVE) et comment est évaluée leur dangerosité (CVSS). Puis vous verrez comment créer votre première pipeline de Continuous Security dans Jenkins au moyen de OWASP DependencyCheck qui détecte les vulnérabilités et trackez-les grâce à OWASP DependencyTrack (logiciels open-source) Faites le premier pas vers le DevSecOps !!!",
    "location": "Salle C",
    "category": "Quicky",
    "speakers": [
      {
        "name": "Julien Topçu"
      }
    ]
  },
  {
    "name": "Comment remplacer le bon vieux polling de mon appli web",
    "startDate": "2018-11-22T12:00:00.000Z",
    "endDate": "2018-11-22T12:15:00.000Z",
    "description": "Vous aussi, vous en avez assez de retrouver du polling dans vos applications Web. Peu performant, et trop consommateur de ressources. Voyageons ensemble au pays du \"push\" et découvrons les principales alternatives du marché (Server Sent Event, Souscriptions GraphQL, et autres).",
    "location": "Salle D",
    "category": "Quicky",
    "speakers": [
      {
        "name": "Cédric Dué"
      }
    ]
  },
  {
    "name": "Repas",
    "startDate": "2018-11-22T12:15:00.000Z",
    "endDate": "2018-11-22T13:20:00.000Z",
    "description": "Miam miam, papoter, visiter les stands ;)"
  },
  {
    "name": "Fonctionnement d'une IA conversationnelle",
    "startDate": "2018-11-22T09:00:00+02:00",
    "endDate": "2018-11-22T09:40:00+02:00",
    "description": "On parle de plus en plus d'IA conversationnelle : mythe ou réalité ? Entre histoire et mathématiques. Entre fiction et réalité. Venez découvrir ce qu'une IA conversationnelle est capable de faire dès aujourd'hui !",
    "location": "Salle A",
    "category": "Keynote",
    "speakers": [
      {
        "name": "Fibre Tigre"
      },
      {
        "name": "Arnold Zephir"
      }
    ]
  },
  {
    "name": "Comment cultiver la dynamique de votre équipe ?",
    "startDate": "2018-11-22T14:10:00.000Z",
    "endDate": "2018-11-22T14:30:00.000Z",
    "description": "Rarement présente dans les indicateurs projet, la **dynamique d’équipe** est pourtant le reflet de la santé d’un projet. De nombreuses équipes se focalisent uniquement sur la vélocité. Pourtant, que l'équipe soit capable de délivrer de la valeur systématiquement est un facteur de motivation et progression. Mais à quoi correspond exactement cette **dynamique d’équipe** ? Que se cache-t-il derrière et pour quels résultats ? Comment la mesurer ? Comment faire en sorte de la maintenir quand des changements s'opèrent de toute part ?De la méthodologie à la technique en passant par la vie de l’équipe, nous ferons un tour d’horizon des pratiques.",
    "location": "Salle A",
    "category": "Quicky",
    "speakers": [
      {
        "name": "Céline Gilet"
      }
    ]
  },
  {
    "name": "Angular & PWA : Mon site survit à l’apocalypse !",
    "startDate": "2018-11-22T14:10:00.000Z",
    "endDate": "2018-11-22T14:30:00.000Z",
    "description": "L'apocalypse et les zombies approchent et comme la quasi-totalité de l'humanité... vous chercherez sur Internet pour savoir comment survivre ! Bonne idée, mais Internet aura disparu... Heureusement, le site de conseils de survie que nous avons développé est en fait une Progressive Web App (PWA), et grâce à ça, pas besoin d'Internet ! Dès votre première visite, tout est dans votre périphérique ! Dans cette présentation, nous verrons comment implémenter dans un site web Angular l'aspect PWA !",
    "location": "Salle B",
    "category": "Quicky",
    "speakers": [
      {
        "name": "Frédéric Jammes"
      },
      {
        "name": "Cyril Lefebvre"
      }
    ]
  },
  {
    "name": "Deep Learning et détection d’intentions",
    "startDate": "2018-11-22T14:10:00.000Z",
    "endDate": "2018-11-22T14:30:00.000Z",
    "description": "La détection instantanée des intentions de nos écrits devient possible, grâce à la puissance des ordinateurs actuels qui permet une analyse approfondie des textes. À travers leur projet, Yuan et Johann vont nous parler des concepts de Deep Learning, de réseaux de neurones et d’analyse sémantique. En seulement 15 minutes vous découvrirez comment certains mots peuvent être rapprochés graphiquement et vous verrez fonctionner une première IA (Intelligence Artificielle) reconnaissant une simple demande provenant d’un mail.",
    "location": "Salle C",
    "category": "Quicky",
    "speakers": [
      {
        "name": "Yuan Ji"
      },
      {
        "name": "Johann Pelfrene"
      }
    ]
  },
  {
    "name": "Des tests sur tous les fronts",
    "startDate": "2018-11-22T14:10:00.000Z",
    "endDate": "2018-11-22T14:30:00.000Z",
    "description": "Tester n'est pas douter : c’est s’assurer du bon fonctionnement de son application, quels que soient les changements que nous pouvons lui apporter. L'écosystème front-end s’est très fortement industrialisé ces dernières années et les tests automatisés ne sont plus l’apanage des applications back-end. Tests unitaires, end-to-end ou encore de non régressions visuelles, nous allons voir ensemble quels sont les différents types de tests qui existent en front-end et quelles sont les stratégies pour leur mise en œuvre.",
    "location": "Salle D",
    "category": "Quicky",
    "speakers": [
      {
        "name": "Mélanie Boudard"
      }
    ]
  },
  {
    "name": "Services vocaux & chatbots : l'UX du futur ?",
    "startDate": "2018-11-22T14:30:00.000Z",
    "endDate": "2018-11-22T15:20:00.000Z",
    "description": "Le web de demain prendra-t-il la forme des buzzwords dont le web d'aujourd'hui nous gave ? On ne parle plus que de cela. Services vocaux, chatbots, intelligence artificielle… Pas un brief n'y échappe, rares sont les réunions privées de l'un de ces termes, et les articles sur les tendances pour l'année à venir sont clairs : c'est bien le futur qui se profile. Parler du web de demain en tant qu'UX designer, c'est donc naturellement se poser des questions sur ces technologies : quelles opportunités peut-on y voir, quelles craintes peut-on formuler ? Quels sont les impacts à l'heure actuelle pour les usagers ? En filigrane, nous nous demanderons aussi si la technologie change le métier de designer. Autant de questions pour cultiver la réflexion : ce web du futur alors, on le dessine comment ?",
    "location": "Salle A",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Amélie Boucher"
      }
    ]
  },
  {
    "name": "Avec les GitLab Runners, comme Mickey dans Fantasia, devenez un apprenti sorcier de l'intégration continue (et du déploiement)",
    "startDate": "2018-11-22T14:30:00.000Z",
    "endDate": "2018-11-22T15:20:00.000Z",
    "description": "Vous êtes un Dev (moi aussi) et vous avez toujours rêvé (comme Mickey) de savoir faire de la magie comme l'Ops (le magicien barbu) de l'équipe, et à chaque fois que vous avez essayé avec diverses solutions de CI, vous avez abandonné car trop compliqué, trop lourd, trop c... . Et pourtant, maintenant avec les **Runners GitLab** vous pouvez commencer à jouer à l'apprenti sorcier et vous faire plaisir (et aussi vous rendre utile).",
    "location": "Salle B",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Philippe Charrière"
      }
    ]
  },
  {
    "name": "La programmation en binôme, c'est magique !",
    "startDate": "2018-11-22T14:30:00.000Z",
    "endDate": "2018-11-22T15:20:00.000Z",
    "description": "Quelle drôle d’idée que deux personnes réalisent une tâche pouvant être réalisée par une seule personne ? Cela ne multiplie-t-il pas les coûts par deux ? Si la programmation en binôme (pair programming) est une bonne pratique Agile, recommandée notamment dans l’eXtrème Programming, elle soulève bien des interrogations et son utilité n’est pas intuitive. Or à l’usage elle transforme radicalement l’activité d’une équipe de développement, tant d’un point vue technique qu’humain. Et si les premiers effets positifs se font ressentir rapidement, des effets sur le long terme, plus inattendus mais tout aussi bénéfiques, émergent aussi.",
    "location": "Salle C",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Frédéric Leguédois"
      }
    ]
  },
  {
    "name": "Votre mission ? Découvrir Haskell et le mettre en prod",
    "startDate": "2018-11-22T14:30:00.000Z",
    "endDate": "2018-11-22T15:20:00.000Z",
    "description": "On entend parler de Haskell de plus en plus, mais il parait souvent bien compliqué de se lancer. Haskell fait peur, avec ses Monades, Monoïdes et autres gros mots. On verra ensemble que vous n'avez absolument pas besoin de savoir ce que ces termes signifient pour vous lancer. Je vous propose de regarder ce dont vous aurez besoin pour créer une petite API, avec de la sécurité et de la gestion de données, soit de quoi mettre une petite application en prod.",
    "location": "Salle D",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Céline Louvet"
      }
    ]
  },
  {
    "name": "Pause",
    "startDate": "2018-11-22T15:20:00.000Z",
    "endDate": "2018-11-22T15:40:00.000Z",
    "description": "Boire un coup, papoter, visiter les stands ;)"
  },
  {
    "name": "Premiers pas avec Capacitor... dans le monde réel",
    "startDate": "2018-11-22T15:40:00.000Z",
    "endDate": "2018-11-22T16:40:00.000Z",
    "description": "Ah, Capacitor, quelle belle idée, une alternative à Cordova plus facile à utiliser, utilisable dans n’importe quel framework, complètement intégré à la prochaine version d’Ionic… Ben non, au moins au début, l’idée de Capacitor me laissait sceptique. J’ai passé les deux dernières années à développer des PWA, alors la pensée de devoir revenir à faire des applications hybrides ou natives me paressait simplement obsolète. Dans ma tête j’avais mis Capacitor dans la case techno cool qui ne m’intéresse pas dans la vraie vie. Mais à ce moment j’ai relu avec attention leur site et j’ai vu une ligne qui m’a séduit : Build web apps that run equally well on iOS, Android, Electron, and as Progressive Web Apps. Hmmm, si je pouvais prendre une PWA et générer à partir d’elle une appli native Android, une autre iOS et une implémentation Electron en bonus, ça pourrait être carrément cool ! J’ai donc décidé de tester Capacitor sur certaines de mes PWA pour voir si je pouvais les transformer en applications natives. Et ce talk est le retour d’expérience de ce processus, mes premiers pas avec Capacitor, ce qui a marché et ce qui n’a pas marché, et surtout ce que j’ai appris dans le processus.",
    "location": "Salle A",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Horacio Gonzalez"
      }
    ]
  },
  {
    "name": "Embarquement Agile : Comment intégrer un nouveau dev en 5 semaines ?",
    "startDate": "2018-11-22T15:40:00.000Z",
    "endDate": "2018-11-22T16:40:00.000Z",
    "description": "Une équipe agile a ses pratiques, ses méthodes, ses outils et ses habitudes... Mais surtout ses êtres humains et sa culture. La culture agile, déjà si difficile à acquérir est encore plus difficile à transmettre. Alors comment fait-on pour embarquer un nouveau dev dans l’équipe ? On a essayé différentes méthodes traditionnelles sans grand succès, puis on a fini par trouver quelque chose qui fonctionne vraiment : 5 mini challenges d’une semaine en terrain inconnu et accompagné d’un nouveau tuteur à chaque fois. Cette session est un retour d’expérience à destination des développeurs, managers, scrum masters, RH et coach agiles...",
    "location": "Salle B",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Florian Ferbach"
      }
    ]
  },
  {
    "name": "Informatique Quantique, Futur ou Réalité ?",
    "startDate": "2018-11-22T15:40:00.000Z",
    "endDate": "2018-11-22T16:40:00.000Z",
    "description": "En quelques minutes, Robin nous fera voyager entre la physique atomique et la physique quantique. Il nous parlera de l’histoire du chat de Schrödinger et de téléportation. Tous cela vous paraît être de la science fiction ? Pourtant les premiers ordinateurs quantiques et les Qbits sont bien réels. Robin exécutera un des premiers programmes « quantique » permettant de casser une clé de cryptage réputée inviolable sur nos machines actuelles.",
    "location": "Salle C",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Robin Szylobryt"
      }
    ]
  },
  {
    "name": "Découvrir par l’exemple : Microservices et Event Sourcing avec Kafka et Kubernetes",
    "startDate": "2018-11-22T15:40:00.000Z",
    "endDate": "2018-11-22T16:40:00.000Z",
    "description": "Lorsque vous développez des applications vous avez besoin de vous adapter rapidement aux changements (métiers, comme technologiques). Pour cela les développeurs et les “ops” doivent travailler de concert, pour déployer toujours plus rapidement de nouveaux services tout en garantissant la haute disponibilité et la montée en charge des applications. Les microservices et l’event-sourcing offrent une grande flexibilité aux développeurs; et la containerization par le biais de Kubernetes permet de déployer ces services en toute tranquillité.",
    "location": "Salle D",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Tugdual Grall"
      }
    ]
  },
  {
    "name": "Vous n'avez pas besoin de ça !",
    "startDate": "2018-11-22T16:40:00.000Z",
    "endDate": "2018-11-22T17:30:00.000Z",
    "description": "React, Microservices, GraphQL, REST, DDD... Tous ces buzzwords porteurs de promesses d'un monde meilleur sont sur toutes les lèvres, de toutes les conférences et s'installent petit à petit dans nos projets. Sont-ils vraiment la seule solution à tous nos problèmes ? Au travers de cette conférence à la description taillée pour le SEO nous verrons qu'il existe des alternatives à ces technologies parfois mieux adaptées au contexte dans lequel nous évoluons tous les jours.",
    "location": "Salle A",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Charles Desneuf"
      }
    ]
  },
  {
    "name": "L'itération 0 : du craftmanship pour le webfront",
    "startDate": "2018-11-22T16:40:00.000Z",
    "endDate": "2018-11-22T17:30:00.000Z",
    "description": "Développer une application web n’est pas du bricolage dans un garage ! Le développement s’industrialise pour réaliser des applications robustes et facilement maintenables. Inspiré des outils du software craftmanship et de l’agilité, nous proposons les pratiques et outils préférés que vous pouvez mettre en œuvre pour réaliser des applications dont vous serez fiers ! Nous parlerons d'intégration continue, de déploiement continu et d'outils comme Gitlab-ci, des reviews apps ...",
    "location": "Salle B",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Christophe Malaboeuf"
      }
    ]
  },
  {
    "name": "Unity 3D - Retour d'expérience sur une app d'1M download",
    "startDate": "2018-11-22T16:40:00.000Z",
    "endDate": "2018-11-22T17:30:00.000Z",
    "description": "Unity3D est devenu le moteur de jeux vidéo le plus populaire et le plus utilisé du marché grâce à sa simplicité d'utilisation, sa facilité d' apprentissage et son modèle économique. Un matin, Florian a eu l'idée de faire son propre jeu vidéo et s'est lancé avec Unity3D dans la réalisation de Little Demolition (un physic-game sur android).",
    "location": "Salle C",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Florian Duboc"
      }
    ]
  },
  {
    "name": "UX et Product Management en contexte agile : monozygotes ou dizygotes ?",
    "startDate": "2018-11-22T16:40:00.000Z",
    "endDate": "2018-11-22T17:30:00.000Z",
    "description": "“Soit agile ! C’est trop design ! Cette boîte est trop lean !... Je trouve que ce n’est pas assez UX...” Mais quelle signification cela a-t-il pour nos clients ? Sommes nous alignés sur les définitions de nos pratiques ? Comment les articuler ? Le product management et l’UX design se complètent-ils ? Leurs périmètres se superposent-ils ? L’UX designer est-il un nouvel imposteur qui vole le travail du Product Owner ? Travailler en équipes pluri-disciplinaires nous amènent à partager nos connaissances et best practices et à trouver notre place au sein du groupe. Nous vous exposerons nos retours d’expériences sur les similitudes et différences entre UX design, Product management en contexte agile. Ainsi que nos pistes pour d’articuler ces différentes pratiques en équipe pour un travail en bonne intelligence et encore plus efficient.",
    "location": "Salle D",
    "category": "Conférence",
    "speakers": [
      {
        "name": "Nadège Bide"
      }
    ]
  },
  {
    "name": "Plénière de clôture - Surprise !",
    "startDate": "2018-11-22T17:30:00+02:00",
    "endDate": "2018-11-22T18:00:00+02:00",
    "location": "Salle A",
    "speakers": [
      {
        "name": "L'équipe de Codeurs en Seine"
      }
    ]
  }
]
