[
  {
    "name": "Ouverture des portes",
    "startDate": "2018-10-18T08:30:00+02:00",
    "endDate": "2018-10-18T09:30:00+02:00"
  },
  {
    "name": "Keynote",
    "startDate": "2018-10-18T09:30:00+02:00",
    "endDate": "2018-10-18T12:30:00+02:00",
    "description": "Octave Klaba, Founder et Chairman d’OVH, et Michel Paulin, directeur général, vous présenteront leur vision stratégique, ainsi que le nouveau plan cloud smart qui redéfinira l’offre cloud d’OVH.",
    "speakers": [
      {
        "name": "Octave Klaba",
        "office": "Founder et Chairman",
        "company": {
          "name": "OVH",
          "website": "https://ovh.com",
          "logo": null
        },
        "social": [
          {
            "twitter": "@olesovhcom",
            "website": "https://ovh.com"
          }
        ]
      },
      {
        "name": "Michel Paulin",
        "office": "Directeur général",
        "company": {
          "name": "OVH",
          "website": "https://ovh.com",
          "logo": null
        },
        "social": [
          {
            "twitter": "@olesovhcom",
            "website": "https://ovh.com"
          }
        ]
      }
    ]
  },
  {
    "name": "Déjeuner",
    "startDate": "2018-10-18T12:30:00+02:00",
    "endDate": "2018-10-18T13:30:00+02:00"
  },
  {
    "name": "Public Cloud - lab avancé : Infra as code avec la CLI et Terraform",
    "startDate": "2018-10-18T13:30:00+02:00",
    "endDate": "2018-10-18T15:00:00+02:00",
    "lang": "FR_fr",
    "description": "Quand l’infrastructure est « à la demande », il devient possible de coordonner la plupart de vos besoins pour industrialiser vos déploiements. Venez vous y essayer via l'orchestrateur Terraform.",
    "location": "Salle 8",
    "category": "Labs",
    "tags": [
      "public cloud",
      "cli",
      "terraform"
    ]
  },
  {
    "name": "Stockage cloud haute performance et optimisé avec Samsung SSD",
    "startDate": "2018-10-18T13:30:00+02:00",
    "endDate": "2018-10-18T14:15:00+02:00",
    "lang": "FR_fr",
    "description": "Partant d’exemples client, Samsung reviendra sur les effets positifs liés à la migration des capacités de stockage cloud des disques durs vers de la mémoire flash. Ceci afin de propulser des applications cloud modernes, qui ont besoin de faibles latences et d’un débit rapide.",
    "location": "Salle 1",
    "category": "Technical",
    "tags": [
      "storage",
      "ssd"
    ]
  },
  {
    "name": "Artisans, indépendants, créateurs d'entreprise : professionnaliser son activité avec les solutions OVH",
    "startDate": "2018-10-18T13:30:00+02:00",
    "endDate": "2018-10-18T14:15:00+02:00",
    "lang": "FR_fr",
    "description": "Vous avez lancé votre activité et souhaitez accroître votre visibilité ? Découvrez comment bien choisir votre nom de domaine, une solution e-mail, ainsi que les outils collaboratifs simplifiant votre quotidien. OVH vous accompagne aussi dans le choix de l’offre d’hébergement web répondant à vos besoins.",
    "location": "Salle 6",
    "category": "Business",
    "tags": []
  },
  {
    "name": "Déployer sa première application avec Kubernetes",
    "startDate": "2018-10-18T13:30:00+02:00",
    "endDate": "2018-10-18T14:15:00+02:00",
    "lang": "FR_fr",
    "description": "Découvrez comment déployer votre première application avec Kubernetes, sur le cloud OVH, et posez vos questions à l'équipe en charge de notre future offre Kubernetes-as-a-Service.",
    "location": "Salle 2",
    "category": "Technical",
    "tags": []
  },
  {
    "name": "Comment mettre en place une plateforme big data sécurisée dans le cloud",
    "startDate": "2018-10-18T13:30:00+02:00",
    "endDate": "2018-10-18T14:15:00+02:00",
    "lang": "FR_fr",
    "description": "Chaque projet big data possède des contraintes qu’il faut prendre en compte. Au travers d’un cas client, découvrez comment mettre en place une plateforme big data critique répondant à tous les critères de scalabilité, d'industrialisation et de sécurité.",
    "location": "Salle 5",
    "category": "Partner",
    "tags": []
  },
  {
    "name": "Solutions de « disaster recovery » et de remplacement de datacenters",
    "startDate": "2018-10-18T13:30:00+02:00",
    "endDate": "2018-10-18T14:15:00+02:00",
    "lang": "FR_fr",
    "description": "Découvrez comment Private Cloud permet de répondre aux exigences de haute disponibilité pour les besoins métier critiques : migrations et interconnexions de datacenters on-premises ou encore plans de reprise d’activité (PRA) sont aujourd’hui disponibles au meilleur rapport coût-performance.",
    "location": "Salle 3",
    "category": "Business",
    "tags": []
  },
  {
    "name": "Comment stocker, organiser et utiliser des pétaoctets de données hétérogènes",
    "startDate": "2018-10-18T13:30:00+02:00",
    "endDate": "2018-10-18T14:15:00+02:00",
    "lang": "EN_en",
    "location": "Salle 4",
    "category": "Technical",
    "tags": []
  },
  {
    "name": "Quoi de neuf pour vos sites web ?",
    "startDate": "2018-10-18T13:30:00+02:00",
    "endDate": "2018-10-18T14:15:00+02:00",
    "lang": "FR_fr",
    "description": "Avec plus de 4,4 millions de noms de domaine, 3 millions de sites webs managés et des dizaines de millions de web apps, OVH est le leader européen de l’hébergement et continue de proposer de nouveaux services pour améliorer votre visibilité en ligne. Découvrez nos produits 2018 ainsi que notre roadmap 2019.",
    "location": "Salle 7",
    "category": "Technical",
    "tags": []
  },
  {
    "name": "Livraison continue et machine learning",
    "startDate": "2018-10-18T15:30:00+02:00",
    "endDate": "2018-10-18T16:15:00+02:00",
    "lang": "EN_en",
    "description": "Découvrez l'approche d'OVH concernant la livraison continue de modèles de machine learning. Le machine learning automatisé permet à l’entreprise de reconstruire efficacement des modèles et de les garder à jour grâce aux données rafraîchies par l’outil « Data Collector ».",
    "location": "Salle 3",
    "category": "Technical",
    "tags": []
  },
  {
    "name": "Nos conseils pour évaluer le coût de vos infrastructures",
    "startDate": "2018-10-18T15:30:00+02:00",
    "endDate": "2018-10-18T16:15:00+02:00",
    "lang": "FR_fr",
    "description": "Vous hésitez entre deux fournisseurs ou offres d'infrastructure ? Retrouvez les 10 points d'attention à ne pas négliger dans l'évaluation des coûts et obtenez les retours d’expérience de plusieurs clients OVH.",
    "location": "Salle 4",
    "category": "Case Study",
    "tags": []
  },
  {
    "name": "Étude de cas : comment Cozy Cloud monitore toutes les couches de son activité avec OVH Metrics",
    "startDate": "2018-10-18T15:30:00+02:00",
    "endDate": "2018-10-18T16:15:00+02:00",
    "lang": "FR_fr",
    "description": "Découvrez comment Cozy Cloud utilise OVH Metrics Data Platform pour monitorer et optimiser son offre SaaS grand public. De l'agrégation des données de performance jusqu'aux métriques d'usage client, les équipes de Cozy partageront avec vous leur expérience de collaboration « data-centric ».",
    "location": "Salle 5",
    "category": "Case Study",
    "tags": []
  },
  {
    "name": "Adoptez une nouvelle approche du stockage et modernisez votre infrastructure",
    "startDate": "2018-10-18T15:30:00+02:00",
    "endDate": "2018-10-18T16:15:00+02:00",
    "lang": "FR_fr",
    "description": "Découvrez comment VMware vSAN accompagne les utilisateurs dans la modernisation de leur infrastructure grâce à « l’Hyper-Converged Infrastructure » (HCI), une solution hyperconvergente. Les experts VMware vous apprendront également à implanter une politique de gestion de stockage sur le cloud OVH.",
    "location": "Salle 1",
    "category": "Technical",
    "tags": []
  },
  {
    "name": "Téléphonie : comment se préparer à la fin du RTC avec la VoIP",
    "startDate": "2018-10-18T15:30:00+02:00",
    "endDate": "2018-10-18T16:15:00+02:00",
    "lang": "FR_fr",
    "description": "Alors qu'Orange annonce la fin de production du réseau téléphonique commuté (RTC) dès 2018, OVH propose depuis 10 ans déjà des solutions de VoIP. Découvrez les alternatives au RTC et la manière dont nous faisons évoluer notre offre de téléphonie vers de nouveaux usages.",
    "location": "Salle 7",
    "category": "Technical",
    "tags": []
  },
  {
    "name": "Démarrez le big data dans l'heure avec Public Cloud",
    "startDate": "2018-10-18T15:30:00+02:00",
    "endDate": "2018-10-18T16:15:00+02:00",
    "lang": "FR_fr",
    "description": "Découvrez comment mettre en place rapidement une infrastructure d’analyse massive de données dans le cloud, avec notre solution clés en main basée sur Public Cloud.",
    "location": "Salle 6",
    "category": "Technical",
    "tags": []
  },
  {
    "name": "Quoi de neuf pour Public Cloud ?",
    "startDate": "2018-10-18T15:30:00+02:00",
    "endDate": "2018-10-18T16:15:00+02:00",
    "lang": "FR_fr",
    "description": "L'équipe Public Cloud travaille au quotidien sur l'amélioration continue du produit, mais également sur de nouvelles fonctionnalités. Découvrez les changements récents et ceux à venir.",
    "location": "Salle 2",
    "category": "Technical",
    "tags": []
  },
  {
    "name": "Quoi de neuf pour nos solutions d'accès à Internet ?",
    "startDate": "2018-10-18T16:30:00+02:00",
    "endDate": "2018-10-18T17:15:00+02:00",
    "lang": "FR_fr",
    "description": "Le groupe IDC prévoit, qu'en 2025, le monde produira 163 zettaoctets de données par an et que 60 % d’entre elles seront créées par les entreprises. Les accès à Internet se doivent donc d'être de plus en plus performants, fiables et sécurisés. Découvrez nos nouvelles solutions dédiées aux professionnels.",
    "location": "Salle 4",
    "category": "Technical",
    "tags": []
  },
  {
    "name": "Monitoring d’infrastructures : aperçu exclusif d’« OVH Insights »",
    "startDate": "2018-10-18T16:30:00+02:00",
    "endDate": "2018-10-18T17:15:00+02:00",
    "lang": "FR_fr",
    "description": "Découvrez, avant son lancement officiel, notre nouvelle solution pour surveiller vos infrastructures. Vous retrouverez dans un tableau de bord unifié les métriques de vos services OVH. Vous utiliserez également les outils déjà éprouvés pour notre offre Data Platforms, de la collecte à l'alerting.",
    "location": "Salle 6",
    "category": "Technical",
    "tags": []
  },
  {
    "name": "Se déployer sereinement dans le cloud : les 5 meilleures pratiques",
    "startDate": "2018-10-18T16:30:00+02:00",
    "endDate": "2018-10-18T17:15:00+02:00",
    "lang": "FR_fr",
    "description": "Se lancer dans le cloud est un défi à la fois technologique et humain. Afin de l'aborder sereinement, il est nécessaire d'avoir toutes les clés en main. Découvrez les meilleures pratiques et les bonnes questions à se poser pour que le plan se déroule sans accroc.",
    "location": "Salle 2",
    "category": "Technical",
    "tags": []
  },
  {
    "name": "Hébergement de données de santé (HDS) : l’entreprise Kénora passe la certification",
    "startDate": "2018-10-18T16:30:00+02:00",
    "endDate": "2018-10-18T17:15:00+02:00",
    "lang": "FR_fr",
    "description": "Kénora souhaite obtenir la certification hébergement de données de santé. Découvrez les mesures de sécurité que doivent mettre en place les fournisseurs informatiques du secteur de la santé pour la protection des données de leurs clients et comment mettre en œuvre ce type de projet.",
    "location": "Salle 5",
    "category": "Case Study",
    "tags": []
  },
  {
    "name": "Les enjeux du e-commerce : faire face à la concurrence d'Amazon",
    "startDate": "2018-10-18T16:30:00+02:00",
    "endDate": "2018-10-18T17:15:00+02:00",
    "lang": "FR_fr",
    "description": "Quels sont les nouveaux enjeux du e-commerce ? Comment les entreprises peuvent-elles y faire face en 2019 pour concurrencer Amazon ? Découvrez les conseils d'Alexandre Eruimy, directeur général de PrestaShop.",
    "location": "Salle 7",
    "category": "Partner",
    "tags": []
  },
  {
    "name": "Table ronde : la conduite du changement, une clé pour réussir sa transition vers le cloud",
    "startDate": "2018-10-18T16:30:00+02:00",
    "endDate": "2018-10-18T17:15:00+02:00",
    "lang": "FR_fr",
    "description": "Nos invités partageront leurs expériences sur les transformations amenées par le cloud ainsi que ses impacts socio-organisationnels et humains. Ils échangeront notamment sur leurs objectifs, les résistances rencontrées, l’évolution des métiers nécessaire et les recettes du succès.",
    "location": "Pleinière",
    "category": "Case Study",
    "tags": []
  },
  {
    "name": "OVH en mode SaaS : retour d'expérience d’un éditeur de logiciel",
    "startDate": "2018-10-18T16:30:00+02:00",
    "endDate": "2018-10-18T17:15:00+02:00",
    "lang": "FR_fr",
    "description": "Matilan est une entreprise de services du numérique (ESN) spécialiste du cloud. Elle réinvente l’utilisation d’un SDDC en mode SaaS pour les éditeurs de logiciels RG System et SPI.",
    "location": "Salle 1",
    "category": "Partner",
    "tags": []
  },
  {
    "name": "« A journey to the cloud » : commencer à migrer son on-premises grâce à Private Cloud",
    "startDate": "2018-10-18T16:30:00+02:00",
    "endDate": "2018-10-18T17:15:00+02:00",
    "lang": "EN_en",
    "description": "Il existe plusieurs réponses à la question : « Comment migrer vers le cloud ? » L'accès à Private Cloud n'a jamais été aussi simple et performant. Découvrez différents cas d'usage et de migration des dernières technologies intégrées à Private Cloud.",
    "location": "Salle 3",
    "category": "Technical",
    "tags": []
  },
  {
    "name": "Private Cloud - lab avancé : migrer et sécuriser ses workloads",
    "startDate": "2018-10-18T16:30:00+02:00",
    "endDate": "2018-10-18T18:00:00+02:00",
    "lang": "FR_fr",
    "description": "Vous avez des connaissances en gestion d'infrastructures VMware (vSphere 6.5), ainsi que des notions de vSAN et d'« infra as code » ? Découvrez comment migrer votre activité au sein de Private Cloud et bénéficiez de solutions vous assurant une sécurisation et une continuité de service.",
    "location": "Salle 8",
    "category": "Labs",
    "tags": []
  },
  {
    "name": "Quels services OVH sont disponibles aux États-Unis et comment en profiter ?",
    "startDate": "2018-10-18T17:30:00+02:00",
    "endDate": "2018-10-18T18:15:00+02:00",
    "lang": "EN_en",
    "description": "Avec deux nouveaux datacenters aux États-Unis, OVH est désormais en mesure de livrer ses services cloud sur le territoire américain. Découvrez vite les offres disponibles sur ce marché et comment les clients OVH peuvent accéder à ces services.",
    "location": "Salle 4",
    "category": "Business",
    "tags": []
  },
  {
    "name": "Créer facilement des tableaux de bord pour administrer vos bases de données avec OVH",
    "startDate": "2018-10-18T17:30:00+02:00",
    "endDate": "2018-10-18T18:15:00+02:00",
    "lang": "FR_fr",
    "description": "Découvrez comment exploiter et administrer à l’échelle d’une entreprise plusieurs centaines de bases de données avec deux administrateurs et les services OVH.",
    "location": "Salle 2",
    "category": "Technical",
    "tags": []
  },
  {
    "name": "Les avantages liés aux configurations des infrastructures Arista / OVH et les technologies de construction et d’exploitation de DC",
    "startDate": "2018-10-18T17:30:00+02:00",
    "endDate": "2018-10-18T18:15:00+02:00",
    "lang": "FR_fr",
    "description": "Arista mettra l’accent sur les technologies de construction et d’exploitation de datacenters et sur les raisons pour lesquelles elles offrent les résultats attendus (gestion de pics de trafic variés, croissance de bande passante, d’end-point et de sécurité ) y compris dans des environnements de production à très grande échelle.",
    "location": "Salle 1",
    "category": "Business",
    "tags": []
  },
  {
    "name": "Développer sa présence numérique grâce à Visibilité Pro",
    "startDate": "2018-10-18T17:30:00+02:00",
    "endDate": "2018-10-18T18:15:00+02:00",
    "lang": "FR_fr",
    "description": "90 % des consommateurs effectuent des recherches sur Internet pour trouver des magasins, produits ou services. Votre visibilité numérique passe donc par une présence étendue dans les annuaires en ligne et une gestion active des avis client. Découvrez nos solutions d'optimisation pour votre activité.",
    "location": "Salle 6",
    "category": "Business",
    "tags": []
  }
]
